// Запам'ятайте 6 хибних (falsy) значень, що приводяться до false у логічному перетворенні: 0, NaN, null, undefined, порожній рядок ""  і false. Абсолютно все інше приводиться до true.

// Логічне «І»​

// Оператор && приводить всі операнди до буля і повертає значення одного з них. Лівий операнд - якщо його можна привести до false, і правий - в інших випадках.

const age = 50;
console.log(age > 10 && age < 30); // true && false -> false
console.log(age < 80 && age > 20); // true && true -> true

// Логічне «АБО»​

// Оператор || приводить всі операнди до буля і повертає значення одного з них. Лівий операнд - якщо його можна привести до true, і правий - в інших випадках.

const weight = 40;
console.log(weight < 10 || weight > 30); // false || true -> true

// Логічне «НЕ»​

//  Логічне «!» - це унарний оператор, який виконує операцію над одним операндом з правої сторони.

const isOnline = true;
const isNotOnline = !isOnline; // !isOnline -> !true -> false
